### Web-scrape for horse results

In [31]:
from selenium import webdriver
from selenium.webdriver.common.keys import Keys
from bs4 import BeautifulSoup
import requests

In [43]:
PATH = "usr/local/bin/chromedriver"
URL = "https://tnetwork.trakus.com/tnet/t_NYRA.aspx?EventID=205193&Date=7/10/2022&Type=TBRED&Venue=23&DisplayType=1"

In [21]:
driver = webdriver.Chrome()
driver.get("https://tnetwork.trakus.com/tnet/t_NYRA.aspx?EventID=205193&Date=7/10/2022&Type=TBRED&Venue=23&DisplayType=1")

In [74]:
def scrape_table(URL):
    #Scrapes the table from the trakus website. 
    #Returns pandas df - will still require some cleaning. 
    dfs = pd.read_html(URL)
    df = pd.DataFrame(dfs[4]) # all the required data is in the fourth level of the output.
    df = df.iloc[:,[2,3,4,5,7,8]]
    df.columns = ["Horse name", "Start", "1/4", "1/2", "3/4", "Finish"]
    
    return df

In [75]:
scrape_table(URL)

,Horse name,Start,1/4,1/2,3/4,Finish
0,Lady Yellen,11/2,24 1/4 23.28,26 1/4 47.21,13 1/2 1:13.21,16 1/2 1:26.86
1,Ms No Vax,61/2,31 1/4 23.89,3Neck 48.19,31 1:14.42,21 1/2 1:28.04
2,Kitty Tin Tin,4Neck,51/4 24.09,51/4 48.56,41 1/2 1:14.62,31/4 1:28.36
3,Madame Rose,2Head,11/2 23.22,11/4 47.17,23 1/2 1:13.84,43 1/4 1:28.44
4,Kay Tee Gal,31/2,4Neck 24.08,64 1/4 48.61,51/2 1:14.90,51/4 1:29.07
5,Lordhearmyprayer,7,61 24.12,42 48.22,68 1:14.97,67 1/2 1:29.14
6,Emerald Banker,5Head,7 24.29,7 49.31,7 1:16.40,7 1:30.63

In [108]:
df.Finish[0].split()[2]

'1:26.86'

In [152]:
def clean_table(df):
    df["Finish_position"] = df.index + 1
    df["Finishing time"] = df.Finish.str.split()
    times = []
    for i in test["Finishing time"]:
        times.append(i[-1])
    df["Finishing time"] = times
    
    return df

In [156]:
output = clean_table(df)

In [157]:
output

,Horse name,Start,1/4,1/2,3/4,Finish,Finish_position,Finishing time
0,Lady Yellen,11/2,24 1/4 23.28,26 1/4 47.21,13 1/2 1:13.21,16 1/2 1:26.86,1,1:26.86
1,Ms No Vax,61/2,31 1/4 23.89,3Neck 48.19,31 1:14.42,21 1/2 1:28.04,2,1:28.04
2,Kitty Tin Tin,4Neck,51/4 24.09,51/4 48.56,41 1/2 1:14.62,31/4 1:28.36,3,1:28.36
3,Madame Rose,2Head,11/2 23.22,11/4 47.17,23 1/2 1:13.84,43 1/4 1:28.44,4,1:28.44
4,Kay Tee Gal,31/2,4Neck 24.08,64 1/4 48.61,51/2 1:14.90,51/4 1:29.07,5,1:29.07
5,Lordhearmyprayer,7,61 24.12,42 48.22,68 1:14.97,67 1/2 1:29.14,6,1:29.14
6,Emerald Banker,5Head,7 24.29,7 49.31,7 1:16.40,7 1:30.63,7,1:30.63

In [194]:
dfs = pd.read_html(URL)
df = pd.DataFrame(dfs[3])

In [195]:
df

,0,1,2
0,"Belmont Park Race 1 Purse $35,000July 10, 20...",NaN,View Trakus T-Chartsâ¢ (Fractional Times)Race...
1,NaN,NaN,NaN
2,Start 1/41/23/4FinishLady Yellen11/2 24 1/4 2...,Start 1/41/23/4FinishLady Yellen11/2 24 1/4 2...,Start 1/41/23/4FinishLady Yellen11/2 24 1/4 2...
3,Race Notes:,Race Notes:,Race Notes: